Table of Contents
 Class PatchDevice
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Abstract class of patch support/load
public abstract class PatchDevice : OpenElementId
Inheritance
object
OpenObject
OpenElementId
PatchDevice
Derived
PatchLoad
PatchSupport
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PatchDevice()
Constructor
public PatchDevice()
Properties
 GeomId
Id representing geometrical parts of Detail
public int GeomId { get; set; }
Property Value
int
 MasterComponent
Master component
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterPoint
Master point 0 - 9
public int MasterPoint { get; set; }
Property Value
int
 Position
Offset between MasterPoint and patch support/load
public Vector3D Position { get; set; }
Property Value
Vector3D
 Edit this page